BankXml/MT102_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns4:getMt102Request xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>ZJfmztzVSvq3z3qu5xwMrNd9daG2g9xaq0QN+x5a1UL5NTN7bj7NZ10rYiv1LK8Q1w0Q0Cy9yJMj&#13;
pQhwHVeRYD7SX+zsGxPY5cvzUn1weT8yR9f2R4AUfe+QWZ1I/PIW3OMVVkIDYYTOsTJGJA8oRJTY&#13;
RjWNpSOeEzn/AVxbutf8ELsOF81niaefjP5MmmfgpAqE/MQEYLZb/sD0U/sDCQUeXh5Ct7SnW5fA&#13;
TRZpTu8dh6BtQG8mUzB8SVXDM2ZIMPMUxRvFNmZ4y2kuq0F8AWckcMJVAjHIS16y6gGBcE59nQRJ&#13;
RqQ45MHTf0WHawxAnzj+MCkJYVH9O8iZAt5WtA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>W4OLlr9GJItlVucEExh1foE79Yza8+4UB3ZK/vrrwLUIH85cFVQG7CBK9ZjtpRjodYm1wSWUndLV&#13;
quK7PNjluN0b1gWndnnuO4S+xUB87su0cAhViPNOAsdOl0uttC3XH9+XDA21wvMjpwD54/zhnlYX&#13;
5zsrW56Ap9hweyFycJqousQTBcvHUvalqn+4O0b5DLbyUbi+omUSd4/PD19bAN0bbKFxBae4IIX+&#13;
xwalDVxERtrsPgLhPAWChRioPlgycH6hfDsTu/xQjEAY0csUCntQH9x6Ct0PGsBtjlRtICROHu1m&#13;
wVgVsPzjXX77HEdZl4aCxMiw0uerFaRzZCnZJPEquVvpVT1yC47KJbP8YOh6cxFUSHtzrHObDdiv&#13;
Vvra7PGujgXMvv1tVQ9ngI/52dfnH9Atp1Yp4Qos2g8FH+/FFGZmQqh5kLtYoKJAwhJ8JtFfxcUO&#13;
RvX8U88Xfj+nuhjdBqnoyV1sycl1oUBknHqzSsIgyWqXEe9zBrgqLP3dfNvaoXY5Fn77voYwKWvJ&#13;
GSDwwzcJkK5jJEYRlOe0O1gFCScgNq5+xQoaIA++ChEqDMntcLFUbKg/glSuev8ClfMlKkNWe7C7&#13;
1GNwcZTARMDTpMrwZwEspKUi0tUAUGLvZCk4F24FBiqyaY67otpgu0GOvbQy2YG5QNg2fpetTh8W&#13;
1zfGU+qerchdMy6iaeOk/Rf+1vEN2255sL6frzF+dbbk/moh1ATZ7F+Ry4NpT0PoNIs/Y+ROzCrW&#13;
g7cMpMPS/od0W+/f+evbDnQJuLr2Uv/FLNGlPhgcmLA598fWE6d8cmSrMzUAiCj13jIrPFzmGxWY&#13;
Zbd+uWqr0cnQcnlSnMRBRsGrqcefetaZoFbCWsErTAmu8bxDLPNGLASt59YeZfi2CtVGShjfJX6p&#13;
O8mrXihXBAGM5cE7q6Tk0A7SflXRpgyhfm+Aahd6qNZCNwzey6tkXzG4bs5vtYMswV/ySflX3UC7&#13;
VLQIWXXOx38/4DGeqcX6LLpgNvhdbfMIAlhMIj9cbyiPnoavlE7MvU53Xeotff8sXZivR6XUOTu7&#13;
nlrlDasdLxUbfp4qJvwCMeyZvB+6sl3jiPFB9RJV8JqnKDv+0fx5Nv709Xf0Zc59H968TIkQJ96L&#13;
aoKBaMqeZp9jJx00zueupAj/ZCvkP0xC7L+Lkjc3pnq26wORfRbdWPj549EgR2lzuWgl5e510gmW&#13;
dfGQwcEkJUb6HcnPhc0AUlO/IQTLaOSkafbRDtHm8drffQW1/NGAYtezDNVNnf4w2AUO14Qly376&#13;
v7BKrJHUPVER26MzHTH0gh0Nw/PY5/2uD5cLD6/lbjDSo8xA2X5MQWqTrfHS1t+SMLcv17dEI8ov&#13;
Ny73/oMybym295P3gzoG/r12ri+tNV0h7tRuPyt0xHOdJYCzBIviREDHy5LxvuQXO9ON039SuBiy&#13;
+hcTCERhPX3g+BVSwWQZyzq6FotWmbXqzegdaATXWAA0hk8F8cwAY+Y/Ra7P7Ulsn7pSI/HH9v40&#13;
KZaBWLudQ0gsGE6YrJLt0NENH5P/doULR7H85HFB/A7Aqc3LhsMJ/MF7F0y0iK+7RjavvS9JFspO&#13;
ZHwMjLaVk7hgOS0rEZIteRhf0w==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns4:getMt102Request></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>jpzZeadDPN1T8LOUrjFXSA4U6Wo=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
QI4zIY+0h7hASH1DSdoWIXvB/foRSmjFHTIx8R89Zj08xqOyrLHCQBFPWT1aS9GkfcfYsekfQ+sX&#13;
WEWFCGa98JfsWEGumgrNfloMYw1dWP9H+WiILNABXxTEjq7uO1eKIreCXcu4wVf6iGMG67gqGRPF&#13;
9CzvZLATK6I3gwhX0I6YdXxcqDCFyBX6Rk+dk8tUi4F/B5h94mJWJ9Oij85f+PMcv0pi/XLLw6e5&#13;
TygG0gvEgfBGLye/xlfWDoSuZSdCRjrlhmnEC7EKV1xc3Ym2Dsb6KVD9Jm60TEqgtdN/HuPxtC3p&#13;
ZBIzdIp96xhVvHNWGYGMIUBBQ0DnFIDtbr9hiA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>